#include <stdio.h>

int main(void){
	int temp;
	int count[5]; //범위가 5이하이기 때문에 총 5개만큼 들어갈 수 있는 공간 만들어줌 [범위가 한정되어 있는 데이터에 한해 정렬을 수행] 
	int array[30] = {1, 3, 2, 4, 3, 2, 5, 3, 1, 2, 3, 4, 4, 3, 5, 1, 2, 3, 5, 2, 3, 1, 4, 3, 5, 1, 2, 1, 1, 1};
	
	for(int i = 0; i < 5; i++){ //0~5까지 
		count[i] = 0; //각 배열을 0으로 초기화 
	}
	for(int i = 0; i < 30; i++){ //30개의 데이터 처리 
		count[array[i] - 1]++; //인덱스 값은 0부터 시작하기 때문에 -1을 빼준 값의 위치에 있는 것을 증가시켜줌. 
	}
	for(int i = 0; i < 5; i++){
		if(count[i] != 0){ //데이터가 0이 아닌 이상, 반복적으로 그 갯수만큼 출력 
			for(int j = 0; j < count[i]; j++){
				printf("%d ", i + 1);
			}
		}
	}
	return 0;
}
